5deg/sna/system/decomposeParDict
/*-------------------------------*- C++ -*---------------------------------*\
|    =========                                                              |
|    \\      /     OpenFOAM                                                 |
|     \\    /                                                               |
|      \\  /       The Open Source CFD Toolbox                              |
|       \\/                                        http://www.OpenFOAM.org  |
\*-------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "mesh decomposition control dictionary";
    location    "system";
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  64;

// preservePatches (inlet);
// preserveFaceZones (heater solid1 solid3);

//method          simple;
// method          hierarchical;
 method          metis;
// method          manual;

simpleCoeffs
{
    n           (2 2 1);
    delta       0.001;
}

hierarchicalCoeffs
{
    n           (2 1 1);
    delta       0.001;
    order       xyz;
}

metisCoeffs
{
 /*
    processorWeights
    (
        1
        1
        1
        1
    );
  */
}


manualCoeffs
{
    dataFile    "decompositionData";
}



//distributed	yes;

//roots
//4
//(
//   "/home/louis/OpenFOAM/louis-1.5-dev/run"
//   "/home/para/Desktop/"
//   "/home/para/Desktop/"
//   "/home/para/Desktop/"
//);



// ************************************************************************* //
