5deg/sna/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

  p               ICCG 1e-06 0;
     pFinal          ICCG 1e-06 0;

    U PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0.1;
    };
    k PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0.1;
    };
    omega PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0.1;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 6;
}


relaxationFactors
{
//p0.3
    p               0.3;
//u0.7
    U               0.7;
    k               0.7;
    omega         0.7;
    R               0.7;
    nuTilda         0.7;
}

// ************************************************************************* //
